/* 
1. 
Зробити змінну типу масив, довжиною 100 елеменнтів. Заповнити його випадковими числами від 0 до 100 включно.
Написати функцію, яка буде створювати новий массив, в якому усі його елменти будуть:
  а) відсортовані по зростанню
  б) усі елементи будуть більше ніж 50 
*/

//створюємо змінну для масиву
const randomArr = new Array();

//наповнюємо масив випадковими числами від 0 до 100 включно, поки в ньому не буде 100 елементів
for (let i = 0; i < 100; i++) {
  randomArr.push(Math.floor(Math.random() * 101));
}

const prettyArr = (arr) => {
  const newArr = [...arr]; //копіюємо  масив
  return newArr
    .filter((el) => el > 50) //спочатку фільтруємо масив щоб залишились елементи більше 50, та була менша кількість елементів для сортування
    .sort(function (a, b) { return a - b;}); // тепер сортуємо те що залишилось

};

console.log(prettyArr(randomArr)); //перевіряємо

