/* 1. 
Зробити змінну типу масив, довжиною 100 елеменнтів. Заповнити його випадковими числами від 0 до 100 включно.
Написати функцію, яка буде створювати новий массив, в якому усі його елменти будуть:
  а) відсортовані по зростанню
  б) усі елементи будуть більше ніж 50 
*/

//створюємо змінну для масиву
const randomArr = new Array();

//наповнюємо масив випадковими числами від 0 до 100 включно, поки в ньому не буде 100 елементів
for (let i = 0; i < 100; i++) {
  randomArr.push(Math.floor(Math.random() * 101));
}
const prettyArray = (arr) => {
  return arr
    .filter((el) => el > 50) //спочатку фільтруємо масив щоб залишились елементи більше 50, та була менша кількість елементів для сортування
    .sort(function (a, b) {
      return a - b;
    }); // тепер сортуємо те що залишилось
};

console.log(prettyArray(randomArr)); //перевіряємо



/* 2. 
Зробити змінну типу масив, довжиною 100 елеменнтів. Заповнити його випадковими строками з літерами англійского алфавіту.
Написати функцію, яка буде створювати новий массив, в якому усі його елменти будуть:
  а) відсортовані по зростанню
  б) усі елемени будуть перетворені у об'єкт типу 
      {
        value: значення з елементу масива
      }
*/

//створюємо змінну для масив
const randomArr2 = [];
//створюємо масив з словами які рандомно будемо використовувати
const word = [
  "Got",
  "ability",
  "shop",
  "recall",
  "fruit",
  "easy",
  "dirty",
  "giant",
  "shaking",
  "ground",
  "weather",
  "lesson",
  "almost",
  "square",
  "forward",
  "bend",
  "cold",
  "broken",
  "distant",
  "adjective.",
];

//наповнюємо масив випадковими строками, поки в ньому не буде 100 елементів
for (let i = 0; i < 100; i++) {
    randomArr2.push(word[Math.round(Math.random() * 19)]);
}

function objArray(arr) {
  return arr
  .map(el => {
    let obj = {}; //створюємо об'єкт в середені циклу
    obj.value = el; //додаємо в об'єект статичний ключ зі значенням кожного елементу по черзі
    return obj; //додаємо новий ою'єкт в масив
  })
  .sort(function (a, b) {
    if (a.value > b.value) {
      return 1;
    }
    if (a.value < b.value) {
      return -1;
    }
  });
}

console.log(objArray(randomArr2)); //перевіряємо
